'''
Подвиг 7. На вход программе подается строка. Прочитайте ее и отобразите все ее символы с нечетными индексами (подряд в одну строчку).

Тесты: https://github.com/selfedu-rus/test-python-base/tree/main/3/3.2.7
'''

a = input()
print(a[1::2])