'''Подвиг 4. На вход программе подаются
две строки (каждая вводится с новой строки).
Необходимо их прочитать и объединить в одну строку через пробел.
Результат вывести на экран.'''
# put your python code here
word1 = input()#.split()
word2 = input()#.split()
print(word1,word2, sep =' ')