'''
Подвиг 6. На вход программе подается слово в виде строки. Необходимо прочитать его и сформировать новую строку,
 где введенное слово будет заключено в двойные кавычки.
Результат вывести на экран.
'''

a = input()
print("\"" + a + "\"")