'''
Подвиг 6. На вход программе подается строка.
Прочитайте эту строку и с помощью метода String.find найдите в ней индекс первого вхождения фрагмента "ra".
Полученное число (индекс) выведите на экран.

Тесты: https://github.com/selfedu-rus/test-python-base/tree/main/3/3.3.6
'''

msg = input()
print(msg.find("ra"))