'''
Подвиг 8. На вход программе подаются три целых положительных
числа (максимум трехзначные), записанные в одну строчку через пробел.
Необходимо их прочитать из входного потока.
Затем, для двухзначных и однозначных чисел добавить слева незначащие нули так,
чтобы все числа содержали по три цифры.
Вывести на экран полученные числа в столбик (каждое с новой строки) в порядке их чтения из входного потока.
'''

a = input().split()
print(a[0].rjust(3, "0"))
print(a[1].rjust(3, "0"))
print(a[2].rjust(3, "0"))

