'''
Подвиг 9. На вход программе подается строка, состоящая из слов, разделенных пробелом.
Необходимо прочитать строку и подсчитать число слов в ней. Результат (число слов) отобразить на экране.

Тесты: https://github.com/selfedu-rus/test-python-base/tree/main/3/3.3.9
'''

a = input()
print(1+a.count(" "))